{
	"argument_private_info": "<p>《Cosmo Privacy Policy》</p><p>Dear Users,</p><p>PLUG Foundation (or referred to as \"Foundation\", \"we\" or “us”) attaches great importance to the privacy protection of you (or referred to as “you” or “user”). When you use the products or services that we provide, we will collect, use, share and protect your personal information in accordance with this privacy policy (the “Policy”).</p><p>Before using this product (\"cosmo wallet\") and the services we provide, please read and fully understand the full content of this policy. The definition of keywords in this policy is consistent with PLUG Foundation's \"cosmo wallet Service Agreement\". By using cosmo wallet, which includes browsing, accessing our website and/or any product or service offered by us, you consent to the collection, use, sharing and protection of your personal information in accordance with this policy.</p><p>This policy can be updated by PLUG Foundation at any time. Once the updated policy is announced, it will replace the original policy. If you do not accept the revised terms, please stop using the products and services provided by us immediately. If you continue to use our services, we will deem it as accepting the revised policy. Once the revised policy is published on cosmo wallet, it will automatically take effect immediately.</p><p>1. What kind of information do we collect from you?</p><p>We collect the following information so as to provide you with cosmo wallet products and services and to continuously improve its quality , including but not limited to supporting our launch of cosmo wallet products, and in compliance with the laws and regulations of the country. Service-related marketing activities, improving existing product and service functions, and developing new products or services. And you do have to understand that if you do not provide the information that is required for our services, your service experience at cosmo wallet may be affected.</p><p>1.1 Identification information, including but not limited to your name, identification, mobile number, email address, biometrics, and wallet address, etc.</p><p>1.2 Technical information, including but not limited to your mobile device model, operating system version, IP address, etc.</p><p>1.3 Platform operation information, including but not limited to your transaction records, and operation records, etc.</p><p>1.4 Other personal information collected in accordance with the needs of our specific products and services, including but not limited to your opinions, suggestions and other information about us as well as our products or services.</p><p>1.5 In addition to the above, you understand that when you use certain features of cosmo wallet, we will give you special tips to collect more personal information from you before collecting your personal information. If you do not consent to it, you will be deemed as abandoning the specific features of cosmo wallet.</p><p>1.6 To the extent permitted by laws and regulations, we may collect and use your personal information in the following situations without your authorized consent:</p><p>(1) related to national security and national defense security;</p><p>(2)related to public safety, public health, and major public interests;</p><p>(3)related to criminal investigation, prosecution, trial and execution of judgments;</p><p>(4)The personal information collected is disclosed to the public by yourself;</p><p>(5)Collecting your personal information from legally publicly disclosed information, such as legitimate news reports, government information disclosure, etc.;</p><p>(6)necessary for the maintenance of safety and compliance of services, such as detection and handling of faults in products and services;</p><p>(7)Other circumstances as stipulated by laws and regulations.</p><p>You have to understand that when you create or import a wallet on cosmo wallet, your mnemonic, private key, password, and so on are stored only on your current mobile device and are not stored on our server. If you do not save or back up your wallet mnemonic, private key as well as other information and your mobile device is lost or damaged, your assets on the blockchain will be lost. We will not be able to recover it for you, and you would need to bear the corresponding losses. If you divulge information when you export, save or back up mnemonics, private keys, passwords, etc., or if the device or server where you save or back up the information is hacked or controlled, your assets on the blockchain will also be lost. Again, PLUG Foundation will not be able to recover it for you and you would have to bear the corresponding losses.</p><p>2. How do we collect your information?</p><p>The way we collect information is as follow:</p><p>2.1 You provide us with your information. We will collect whatever information that you provided to us when using our products and services, or when you provide us with feedback including but not limited to your name, mobile number, email address, etc.</p><p>2.2 We obtain information during your use of cosmo wallet or when you visit our website, including your IP address, mobile device information and your operating records of cosmo wallet;</p><p>2.3 We copy all or part of your transaction history through the blockchain system. However, the transaction records are subject to the records of the blockchain system.</p><p>3. How do we use your information?</p><p>The information we collect will primarily be used to improve the quality of our products and services. We will never rent, trade or sell your personal information without your prior consent. We will use or disclose your personal information for one or more of the following purposes:</p><p>3.1 When it is necessary to get in touch with you;</p><p>3.2 We will promptly send you important notices such as software updates, service agreements and changes to the terms of this policy;</p><p>3.3 To inform you about our products, services, marketing activities, etc.</p><p>3.4 We will process the feedback you submit to us by collecting your public wallet address and mobile device information that you provided;</p><p>3.5 We will collect your personal information for our internal audit, data analysis and research, etc., as well as to continuously improve our level of service;</p><p>3.6 According to the \"cosmo wallet Service Agreement\" and other relevant provisions of us, PLUG Foundation will use users information to manage and handle their usage behaviors;</p><p>3.7 Requirements for laws and regulations and cooperation with regulatory agencies;</p><p>3.8 Other reasonable purposes relating to the above purposes.</p><p>4. How do you manage your information?</p><p>You have the following autonomy over your personal information in cosmo wallet:</p><p>4.1 You can import other wallets into cosmo wallet, or import your cosmo wallet into another digital token management wallet. cosmo wallet will display the information imported into the wallet;</p><p>4.2 You understand that you can modify your digital token type, transfer, collection, etc. through the assets section;</p><p>4.3 You know that you can delegate, withdraw, etc. to the validators you specify through the \"Delegation\" section;</p><p>4.4 You know that in the \"Me\" section of cosmo wallet, you can view and modify your \"Address Book\" at any time in the \"Address Book\" section;</p><p>4.5 You acknowledge that when we collect information from you for a specific purpose, we will give you notice in advance. You reserved the right to opt out. But at the same time, you have to know that when you choose not to provide certain relevant information, this would mean that you are giving up on using the services of cosmo wallet.</p><p>4.6 You understand that both you and the Foundation have no control over whether or not your transaction records are made public, because it is open source on the blockchain trading system. Your transaction records are transparent throughout the blockchain system.</p><p>4.7 You have the right to request us to update, change, or delete your personal information.</p><p>4.8 You acknowledge that we may collect your information in accordance with article 1 of paragraph 6 of this policy without obtaining your authorization.</p><p>5. We may share or transmit your information.</p><p>5.1 The personal information collected and generated by PLUG Foundation within the territory of Hong Kong SAR will be stored on the servers within the territory of Hong Kong SAR. If we really need to transfer your personal information to overseas, we need your authorization beforehand and will conduct cross-border data transmission in accordance with the relevant laws, regulations and policies, and fulfill your confidentiality obligations for your personal information.</p><p>5.2 We will not share or transfer your personal information to any third party without your prior consent, except in the following cases:</p><p>(1) Obtain your explicit consent or authorization in advance;</p><p>(2) The personal information collected is disclosed to the public by yourself;</p><p>(3) The personal information collected is from legally publicly disclosed channels, such as legal news reports and government information disclosure channels;</p><p>(4) Shared with the affiliates of PLUG Foundation, we will only share the necessary user information and we are bound by the purposes stated in this privacy policy;</p><p>(5) Providing or enforcing this policy to protect the rights, property or rights of Foundation or other parties in accordance with applicable laws and regulations, legal procedures, requirements of the executive or the judiciary;</p><p>(6) When it comes to mergers and acquisitions, if it involves the transfer of personal information, we will require the recipient of personal information to continue to be bound by this policy;</p><p>(7) When we have reason to believe that you have violated one or more of the terms of this agreement and caused damage to the Foundation or a third party.</p><p>6. Information security</p><p>6.1 If we ceases to operate, it will stop collecting your personal information in a timely manner, and announce the notice of suspending its operation on cosmo wallet. On top of that, it will delete or anonymize your personal information held within a reasonable period of time.</p><p>6.2 To protect your personal information, we use physical and electronic security measures to keep your information secure and secure all connections to industry-standard transport layers.</p><p>6.3 We increase internal employee information security training, improve internal compliance, and securely protect your private information by setting secure access to relevant data.</p><p>7. Protection of minors</p><p>We are particularly sensitive to information that protects minors under the age of 18. Our services are not for minors, and we do not deliberately collect information from minors. If you are a parent or legal guardian of a minor child, we will represent you under the other provisions of this privacy policy. Any information provided to us by a child when using a trust wallet is considered personal information. We make the following special agreement on this:</p><p>7.1 Minors should use our related services under the guidance of their parents or guardians.</p><p>7.2 Parents and guardians of minors are advised to guide minors to use cosmo wallet under the guidance of this policy, the cosmo wallet Service Agreement and our other relevant rules.</p><p>7.3 cosmo wallet will protect the confidentiality and security of minors' personal information in accordance with the laws and regulations of the country or area you reside in.</p><p>8. Disclaimer</p><p>PLUG Foundation will take reasonable security measures to protect your personal information as far as possible under the state of the art to avoid disclosure, tampering or damage. We uses wireless transmission of data, so it could not ensure the privacy and security of data transmitted over a wireless network.</p><p>9. Others</p><p>9.1 If you are a user outside Hong Kong SAR, you need to fully understand and comply with all relevant laws, rules and regulations in your jurisdiction and the use of our services.</p><p>9.2 If you encounter any problems with the use of personal information during the use of our Services, you can provide us with feedback by sending an email to techsupport@plugchain.info.</p><p>9.3 You can view this policy and other Foundation service rules in cosmo wallet. We encourage you to review our service agreements and privacy policies each time you visit cosmo wallet.</p><p>9.4 Any translation of this policy is provided for convenience only and is not intended to be modified by the terms of this policy. If there is any inconsistency between a translation and the English version of this policy, the English version prevails.</p><p>This policy applies from September 01, 2021.</p><p>In the absence of this policy, you are subjected to the announcements and related rules that we updates from time to time.</p><p>PLUG Foundation</p>",
	"argument_user_info": "<p>《cosmo Terms of Use (EN)》</p><p>Dear users,</p><p>Welcome! The \"cosmo wallet Service Agreement\" (hereinafter referred to as \"this Agreement\") is signed by PLUG Foundation (referred to as the \"Foundation,\" \"we\",\"our\" or \"us\") and users (hereinafter referred to as \"you\" or \"User\"). There is a contractual legal effect for you and our company.</p><p>We hereby reminds you to read the \"cosmo wallet Service Agreement\" and the following relevant agreements, especially the terms of the \"Limitation of Liability & Disclaimer of Warranties\" before using cosmo wallet (\"cosmo wallet\" or \"The Software\"), visiting our website and accepting our services. Please ensure you fully understand the terms of this Agreement and consider risks yourself.</p><p>HOW YOU ACCEPT THIS POLICY</p><p>By downloading cosmo wallet, or accessing our website, you are deemed to have fully read and accepted all the terms of this Agreement and the related \"Privacy Policy\". This Agreement is effective immediately and is binding on both parties.</p><p>We reserve the right to change this Agreement at any time. Any changes to the Agreement, as posted on cosmo wallet or our website, will automatically take effect without notice. After the Foundation announcing the terms of the revised agreement, if you do not accept the revised terms, please stop using cosmo wallet, our website and other services immediately. And your continued use will be deemed to accept the revised agreement.</p><p>If you are under the age of 18, or have no civil capacity or restricted capacity, use the cosmo wallet under the direction of your parent or guardian.</p><p>DEFINITION</p><p>1. cosmo wallet:</p><p>A blockchain wallet developed based on the PLUG Network's single-chain system (and other blockchain systems that will be supported in the future), including other tools developed to facilitate the use of blockchain systems.</p><p>2. Eligibility:</p><p>2.1 You must be a natural person with full civil capacity.</p><p>2.2 If you are using the cosmo wallet service for minors under the age of 18, you will need to use the cosmo wallet under the direction of your parent or guardian. cosmo wallet reserves the right to ask you and your parent or guardian to be responsible for any consequences of the use of cosmo wallet or a person with limited capacity to conduct a transaction beyond the scope of his or her civil rights or capacity.</p><p>2.3 If you are a user outside Hong Kong SAR, you may only use our services as permitted by the laws of your region. Please ensure that these terms comply with all laws, rules and regulations that apply to you.</p><p>2.4 By using cosmo wallet, you are warranted to comply with all of the eligibility requirements listed in these Terms. However, we may still refuse to allow certain people to access or use our products and services, and we reserve the right to change eligibility criteria at any time.</p><p>3.Create or Import a wallet</p><p>Use cosmo wallet to confirm the process of fulfilling this agreement and creating or importing a wallet.</p><p>4.Wallet password</p><p>During the process of creating a cosmo wallet, the software operation interface prompts you to fill in a password that is used to encrypt and protect the private key. The wallet password is not stored on your mobile device or on our server. Once you lose it, you need to reset the new password with the aid of a mnemonic.</p><p>5.Notification</p><p>The information prompts involved in the cosmo wallet software operation interface are recommended to follow the prompts.</p><p>6.Specific User</p><p>Refers to users who must cooperate with us in fulfilling their personal information disclosure obligations in accordance with Hong Kong SAR laws, regulations and policies.</p><p>7.Private Key</p><p>Consisting of 256-bit random characters, it is the core of your own and use of Token.</p><p>8.Public Key</p><p>The public key is generated by the private key by means of cryptographic principles, and is used to generate a blockchain digital wallet address, which is the public collection address.</p><p>9.Mnemonic</p><p>We follow the blockchain BIP39 industry standard. The 24 ordered English words generated through your own devices (mobile phones, tablets, etc.) randomly are your mnemonics. The mnemonic is an easy-to-record representation of the private key, which is convenient for users to backup and keep.</p><p>10.Token</p><p>The Token category supported by cosmo wallet, including but not limited to the native Token of PLUG Hub.</p><p>11.Personal Information</p><p>Various information recorded electronically or otherwise that can identify the user's personal identity, either alone or in combination with other information, including but not limited to the name of the natural person, date of birth, ID number, personal biometric information, address, telephone number, bank card number , email address, wallet address, mobile device information, operation history, transaction history, etc., but not the user's wallet password, private key, and mnemonic.</p><p>THE SERVICES</p><p>1.Create or Import a wallet</p><p>For Tokens supported by cosmo wallet, you can use cosmo wallet to generate a new wallet or import the generated wallet via mnemonics. If you accidentally forget your password, you can use the mnemonic to import the created wallet and reset your password. The process of creating mnemonics belongs to the local behavior. It can be operated in the case of network disconnection, it has nothing to do with our server. Therefore, we do not have your mnemonic and cannot retrieve mnemonics for you.</p><p>2.Watch Wallet</p><p>For Tokens supported by cosmo wallet, you can use cosmo wallet to import a Watch Only Wallet from the generated wallet address. You can view the Token information of the address and initiate a transaction request. Your device will not save the private key, mnemonic and other information of the wallet. The Watch Only Wallet will only take effect after the private key signature authentication and authorization of the import address. And each time a transaction is initiated, the private key signature is required, please make sure that you are the actual holder of the import address private key.</p><p>3. Send, Recieve token</p><p>You can use the payment and collection function of cosmo wallet to manage Token, that is, use the private key to electronically sign and modify the ledger of the relevant blockchain. This \"payment\" involves a valid record of the transaction in the distributed system of the relevant blockchain (rather than actually delivering or transferring digital tokens on the cosmo wallet).</p><p>4. Delegate, Redelegate, Undelegate and Withdraw rewards</p><p>You can view the profile of the trusted Validator, the voting power, the public key, the commission rate, and can initiate a transaction to the specified Validator. The delegation transactions involves a valid record of the transaction in the distributed system of the relevant blockchain (rather than actually delivering or transferring digital tokens at cosmo wallet).</p><p>5. Manage Token</p><p>You can use cosmo wallet to add, keep, or remove Tokens supported by cosmo wallet.</p><p>6. Transaction History</p><p>We will copy all or part of your transaction history through the blockchain system. However, the transaction records are subject to the records of the blockchain system.</p><p>7. Discontinuance of Services</p><p>We can't suspend or cancel the payment transaction for you based on the \"irrevocable\" nature of the blockchain system transaction. And under certain circumstances, we can suspend or limit the operation of a user on the cosmo wallet software.</p><p>8. Other services that we believe are necessary.</p><p>You acknowledge the following when you accept the above services provided by us:</p><p>(1) We provides distributed services due to the distributed nature of the blockchain. We cannot control the blockchain network, which is greatly different from banking financial institutions. You should fully understand and agree that we cannot provide the following services:</p><p>Store your wallet password (the password set when the you creates/imports the wallet), private key, and mnemonic;</p><p>Retrieve the your wallet password, private key, and mnemonic;</p><p>Freeze the wallet;</p><p>Report the loss;</p><p>Restore the wallet;</p><p>Cancel or Roll back Transaction.</p><p>(2) You should keep your own mobile devices with cosmo wallet, backup cosmo wallet, backup wallet password, and mnemonic. If the user loses the mobile device, deletes and does not back up the cosmo wallet, the wallet is stolen or you forget the wallet password and the mnemonic, we are unable to restore the wallet or retrieve the wallet password, private key and mnemonic; If the user mishandles the transaction (for example, the wrong payment address), we cannot cancel the transaction.</p><p>(3) The Token management service that we and cosmo wallet can provide does not include all Tokens. Do not operate any Token that cosmo wallet does not support through it.</p><p>(4) cosmo wallet is only a Token management tool, not an exchange or trading platform. Although this Agreement will refer to “transactions” many times, it refers to the send, delegate, undelegate, redelegate, withdraw rewards operations performed by the user using cosmo wallet, which is essentially different from the “transaction” conducted on the exchange or trading platform. We do not own, control or operate these networks, and therefore cannot guarantee that any transactions submitted through our services will be confirmed and processed because of the network characteristic of blockchain. With cosmo wallet, you acknowledge and agree that the transaction you submitted may not be completed by the blockchain network or may be significantly delayed.</p><p>(5) Agreed to this Agreement, you are deemed to have understood and proficient in the blockchain assets and wallet related matters. If you still do not understand of such matters, you should immediately terminate the use of our products and services, you have the responsibility and obligation to keep the assets in your account safe, and we are not responsible for providing training or implied with legal liability.</p><p>(6) We have the right to provide differentiated services at different times, in different regions or from different network sources for reasonable reasons. We do not guarantee that users at all times, all regions or all network sources will always get a platform response. We will not be liable for any loss or loss of service caused by the user.</p><p>RIGHTS AND OBLIGATIONS</p><p>1. Create or import a wallet</p><p>1.1 Create or import a wallet</p><p>You can create or import a wallet via cosmo wallet on your mobile device, set the wallet's password and other information, and you can initiate transactions via the cosmo wallet app.</p><p>1.2 Authentication</p><p>In accordance with relevant laws, regulations and policies, specified users should complete the relevant authentication in accordance with the instructions of cosmo wallet when using the services provided by cosmo wallet, and ask you to submit, including but not limited to, your name, ID number, mobile number, Personal information such as bank card number information. Otherwise, the specific user will not be able to use the service, and the loss caused by the delay of the specific user is at your own risk.</p><p>1.3 We may develop different software versions for different terminal devices. You should choose to download the appropriate version for installation according to actual needs. If you obtain the software or the installation program with the same name as the software from a third party that is not legally authorized, we cannot guarantee the normal use of the software or the security of the software, and the loss is at your own risk.</p><p>1.4 After the new version of the software is released, the old version of the software may not be available. We do not guarantee the security of the old software, continue to provide usability and provide corresponding customer service. Please check and update the latest version at any time.</p><p>2. Use of cosmo wallet</p><p>2.1 You should keep your mobile device, wallet password, private key, mnemonic, etc. We are not responsible for keeping this information for you. You are solely responsible for any risks, liabilities, losses, and expenses incurred as a result of your loss of mobile devices, active or passive disclosure, forgotten wallet passwords, private keys, mnemonics, or attacks, fraud, etc.</p><p>2.2 Follow the information prompts. You should follow the information that cosmo wallet makes to you and follow the information prompts. Otherwise, all risks, liabilities, losses, expenses, etc. caused by you shall be borne by you.</p><p>2.3 Please complete the authentication actively. When we believe that your trading behavior or trading situation is abnormal, or that your identity information is suspect, or if cosmo wallet believes that you should check your identity documents or other necessary documents, please cooperate with cosmo wallet to check your valid identity document or other necessary documents to complete the relevant authentication in a timely manner.</p><p>2.4 Transactions</p><p>(a)You are aware that your daily cumulative limit and number of transactions may be due to the country/region where you are using the payment service, regulatory requirements, transaction purposes, Risk Wallet risk control, etc.</p><p>(b) You understand the \"irrevocable\" attribute based on blockchain operation. When you use the cosmo wallet to initiate a transaction, you should bear the consequences of your operation errors (including but not limited to the wrong collection address and your own choice of node server).</p><p>(c) You are aware that when using the cosmo wallet service, the following conditions may result in a \"transaction failure\" or \"package timeout\":</p><p>The wallet balance is insufficient;</p><p>Blockchain failed to execute;</p><p>Exceeding the transaction amount required by the regulatory authorities, cosmo wallet or laws and regulations;</p><p>Technical problems of network and equipment;</p><p>The abandoned transaction caused by blockchain network congestion and faults, etc.</p><p>Your address or counterparty address is identified as a special address, such as a high-risk address, an exchange address, and so on.</p><p>2.5 Legitimacy</p><p>When using cosmo wallet, you should follow the relevant laws and regulations and national policies.</p><p>2.6 Fees</p><p>cosmo wallet does not charge you any fees for any of its Services. However, we reserve the right to do so in the future and, in such case, we will stipulate or publish the rules separately and will prompt you before you use any of the paid services.</p><p>ASSUMPTION OF RISK</p><p>1.Due to the fact that the laws, regulations and policies in the blockchain field are not yet sound, you acknowledge and agree that Token in this field may have significant risks such as failing to cash and technical instability. And Token's price volatility is much higher than other financial assets. We caution you to rationally choose to hold or dispose of any Token based on your financial situation and risk appetite.</p><p>2. When using the cosmo wallet, if you or your counterparty fails to follow the operation tips and rules in this agreement or related website and APP description page, we do not guarantee that the operation will be completed smoothly, and we will not bear liability for the damage.In the event that the above scenario occurs and the blockchain asset has been credited to your or your counterpart's cosmo wallet or third party‘s wallet, you understand the “irreversible” nature of the blockchain operation and the irreversible transaction. You and your counterparts bear the corresponding risk. We strongly recommend to carefully review your transaction details before attempting to transfer your Token.</p><p>3. Please ensure the other party you decide to deal with is a fully civil capacity person, you bear all the risks associated with it.</p><p>4. In the transaction process, if there is a similar information such as “transaction failure”, “package timeout”, etc., you should reconfirm through the official route of the relevant blockchain system or other blockchain query tools. Avoid repeated payments; otherwise, all losses and expenses caused by this shall be borne by you.</p><p>5. You understand that when you create or import a wallet on cosmo wallet, your private key, mnemonic, etc. are only stored on the current mobile device and are not stored on the cosmo wallet or our server. You can replace your mobile device via importing wallet, etc., according to the instructions provided by cosmo wallet. However, if you do not save or back up your wallet password, mnemonic, etc. and your mobile device is lost, your Token will be lost. We will not be able to retrieve it for you. You will be responsible for the loss. If you leak when exporting, saving or backing up your wallet password, mnemonic, etc., or if the device or server that saves or backs up the above information is hacked or controlled, your Token will be lost. We cannot retrieve it for you, and you will be responsible for the loss.</p><p>6. We recommend that you make a secure backup of your wallet's password, mnemonic, etc. when creating or importing your wallet. We draw your attention, please do not use the following backup methods: screenshots, e-mail, notepad, SMS, WeChat, QQ and other electronic backup methods. We recommend that you copy information such as mnemonics on a paper notebook, and you can also keep your electronic data in the password manager.</p><p>7. We recommend that you use cosmo wallet in a secure network environment to ensure that your mobile device is not jailbroken or rooted to avoid potential security risks.</p><p>8. Please be alert to non-official fraud when using our service. We encourage you to inform us as soon as you find such behavior.</p><p>SERVICE CHANGE, INTERRUPTION, TERMINATION</p><p>1. You understand and agree that PLUG Foundation may temporarily provide some of its service functions, suspend some service functions or open new service functions in the future to ensure that its own business operations rights. When any feature is reduced, increased or changed, you will still agree to the terms of this Agreement as long as you still use the services provided by us.</p><p>2. You understand and agree that we requires the maintenance of platforms that provide network services (such as Internet sites, mobile networks, etc.) and related devices on a regular or irregular basis, and that Internet connectivity is affected by global network stability, technical conditions, user location and network used, power supply, government regulation, computer viruses, hacking attacks, etc. The Foundation does not require any liability for this. No prior notice is required except in special circumstances.</p><p>3. You understand that we will suspend the provision of services in following situations:</p><p>3.1 Interruption of business due to technical reasons such as equipment, blockchain system maintenance, upgrades, failures and communication interruptions;</p><p>3.2 Due to the \"force majeure\" , our system cannot provide services or we reasonably believes that there will be greater risks in continuing to provide services; \"force majeure\" events include but are not limited to information network equipment maintenance, information network connection failure, fault of computers, communications or other systems, power failures, strikes, labor disputes, riots, uprisings, riots, lack of productivity or means of production, fires, floods, storms, explosions, wars, government actions, orders of the judiciary, and etc.</p><p>3.3 Other situations where we cannot control or reasonably foreseen.</p><p>4. We may suspend or terminate some or all of your functions unilaterally in the following situations:</p><p>4.1 User’s death;</p><p>4.2 Stealing someone else's wallet information or mobile device;</p><p>4.3 Provide false information when filling out personal information;</p><p>4.4 Rejecting the mandatory update operation we initiated to improve our Products or Services;</p><p>4.5 Use cosmo wallet for illegal or criminal activities;</p><p>4.6 Prevent other users from using it normally;</p><p>4.7 Falsely claiming as our staff or management staff;</p><p>4.8 Attack, invade, alter, or other ways to threaten the proper functioning of our computer systems;</p><p>4.9 Promote spam ads with cosmo wallet;</p><p>4.10 Spread rumors and damage our goodwill;</p><p>4.11 Violations, other violations of this Agreement, and circumstances in which we reasonably believe that the function should be suspended.</p><p>5. When the service relationship between you and us is changed, interrupted, or terminated, you still have the right to export information such as your wallet within a reasonable time.</p><p>COMMITMENT TO LEGAL USE OF OUR SERVICES</p><p>1. You shall abide by the relevant laws and regulations of Hong Kong SAR and the laws and regulations of your country or region, and may not use cosmo wallet for any illegal purposes or use our Service in any illegal way.</p><p>2. You may not use cosmo wallet for illegal or criminal conduct, including but not limited to:</p><p>2.1 Oppose the basic principles established by the Constitution, which endangers national security, leaks state secrets, subverts state power, and undermines national unity;</p><p>2.2 Engage in any criminal activity, including but not limited to money laundering, illegal fund raising, etc.;</p><p>2.3 Intervene or attempt to interfere with any user or any other means to access our services by using any automated program, software, engine, web crawler, web analytics tool, data mining tool, or similar tool to access our service, collect or process content we provide.</p><p>2.4 Provide gambling information or induce others to participate in gambling in any way;</p><p>2.5 Use of our services in any form infringes on the company's commercial interests, including but not limited to the release of commercials that are not licensed by the company;</p><p>2.6 Invade other people's cosmo wallet to steal Token;</p><p>2.7 Conduct a transaction that is inconsistent with the transaction content claimed by the counterparty, or an untrue transaction;</p><p>2.8 Engage in any infringement or possible violation of our service systems and data;</p><p>2.9 Infringe the patent, copyright, trademark, reputation or any other legal rights of any other third party;</p><p>2.10 Other violations and actions that we have justified for improper reasons.</p><p>3. You understand and agree that if you breach the relevant laws (including but not limited to regulations relates tp customs and tax) or the provisions of this Agreement, you should compensate us, including reasonable attorney fees, if we suffer any loss, claim by any third party or any administrative department Penalties.</p><p>4. You promise to pay our service fees (if any) on time, otherwise we reserves the right to suspend or stop the services provided to you.</p><p>PRIVACY POLICY</p><p>We attach great importance to the protection of users' privacy. For related privacy protection policies, please refer to the “cosmo wallet Privacy Policy” that we update from time to time.</p><p>LIMITATION OF LIABILITY&DISCLAIMER OF WARRANTIES</p><p>1. PLUG Foundation is only responsible for the obligations set forth in this Agreement.</p><p>2. You acknowledge and agree that, to the fullest extent permitted by law, we may only provide services in accordance with the current state of the technology. We are not responsible for the failure to provide services due to the following reasons:</p><p>2.1 Our system is down for maintenance or upgrades;</p><p>2.2 Force majeure causes such as typhoons, earthquakes, floods, lightning or terrorist attacks;</p><p>2.3 The hardware and software of your mobile device and the communication and power supply are faulty;</p><p>2.4 You use our services improperly or not authorized or approved by us;</p><p>2.5 Causes due to viruses, Trojans, malicious program attacks, network congestion, system instability, system or equipment failure, communication failures, power failures, banks, or government actions, etc;</p><p>2.6 Any other reason not caused by us.</p><p>3. We are not responsible for the following situations:</p><p>3.1 Token losses caused by the user losing the mobile device, deleting and not backing up the cosmo wallet, deleting and not backing up the wallet, the wallet being stolen or forgetting the wallet password and the mnemonic;</p><p>3.2 Token losses caused by the user disclosing the wallet password, private key, mnemonic, or borrowing, transferring or authorizing others to use their mobile device or cosmo wallet, or downloading the cosmo wallet app through unofficial channels or other unsafe ways.</p><p>3.3 Token losses due to users' misoperation (including but not limited to the wrong address you imported);</p><p>3.4 Token losses caused by misoperation because that the user do not understand the nature of the blockchain technology;</p><p>3.5 Due to the time lag, the instability of the blockchain system, etc., the transaction records of our copy users on the blockchain are deviated.</p><p>4. We may provide services to you and your counterparties at the same time. You agree to expressly waive any actual or potential conflicts of interest in our conduct, and cannot claim that we have flaws in the provision of services. This does not add to our responsibility or duty of care.</p><p>5. We do not provide guarantees in the following forms:</p><p>5.1 Our services will meet all your needs;</p><p>5.2 Any technology, products, services, and information you obtain through our services will meet your expectations;</p><p>5.3 The parties that you trade with on cosmo wallet will promptly perform their obligations in the transaction agreement with you.</p><p>6. You understand that cosmo wallet is only used as a tool for users to manage Tokens and display transaction information. We do not provide legal, tax or investment advice. You should seek advice from professionals in the legal, tax, and investment fields, and we are not responsible for any investment losses, data loss, etc. that you suffer from using our services.</p><p>7. You understand that we may change our user access criteria from time to time, limiting the scope and manner of providing services to a particular group, as required by relevant Hong Kong SAR policies and regulations.</p><p>COMPLETE AGREEMENT</p><p>1. This Agreement consists of the \"cosmo wallet Service Agreement\", the \"cosmo wallet Privacy Policy\" and the rules published by us from time to time, including the contents of the Help Center.</p><p>2. Part of this agreement is deemed to be a violation or invalid by a court of competent jurisdiction but does not affect the validity of other content.</p><p>3. Any translation of this Agreement is provided solely for the convenience of the User and is not intended to modify the terms of this Agreement. In the event of a conflict between the English version and the non-English version of this Agreement, the English version shall prevail.</p><p>INTELLECTUAL PROPERTY</p><p>cosmo wallet is an application that PLUG Foundation developed and own intellectual property. The intellectual property rights of any content displayed in cosmo wallet, including this Agreement, announcements, articles, videos, audio, images, files, information, materials, trademarks or logos, are owned by us or third party rights holders. Users can only use the cosmo wallet application and its contents for the purpose of holding and managing tokens. No one may use, modify, reverse compile, reproduce, publicly transmit, alter, distribute, release or publicly publish such applications and content without the prior written consent of us or third party rights holders.</p><p>GOVERNING LAW</p><p>1. The validity, interpretation, alteration, enforcement and dispute resolution of this Agreement and its amendments shall be governed by the laws of Hong Kong SAR. If there is no relevant legal provisions, international business practices and/or industry practices shall be applied.</p><p>2. If there is any dispute between you and us, it should first be settled through friendly negotiation. If the negotiation fails, either party may submit it to the jurisdiction of the people's court in our jurisdiction.</p><p>OTHERS</p><p>1. If you are a user outside Hong Kong SAR, you need to fully understand and comply with all relevant laws, rules and regulations in your jurisdiction related to the use of our Services.</p><p>2. If you encounter any problems during the use of our services, you can send us feedback through email techsupport@plugchain.info.</p><p>3. You can view this agreement in cosmo wallet. We recommend you to review the service agreement each time you visit cosmo wallet.</p><p>4. This Agreement shall apply from September 01, 2021.</p><p>5. In the absence of this Agreement, you are subject to the announcements and related rules we update from time to time.</p><p>PLUG Foundation</p>",
	"argument_private_title": "Privacy protection agreement",
	"argument_user_title": "User Services Agreement",
	"exitAppToast": " Press again to exit the app",
	"tabbarLabel_wallet": "Wallet",
	"tabbarLabel_pledge": "Stake",
	"tabbarLabel_proposal": "Proposal",
	"tabbarLabel_ecology": "ecology",
	"upgradeTitle": "New version found",
	"upgradeVersionSkip": "Skip current version",
	"upgradeVersionInstall": " Download updates",
	"verifierNodeRunning": "Running",
	"verifierNodeOffline": "Offline",
	"verifierNodeJailing": "Jailing",
	"verifierNodeInvalid": "Expired",
	"pledgeRawardForYear": "Estimated APY",
	"pledgeVolumeForVerifier": "Total Node Staked",
	"pledgeVolumeForUser": "My Stake",
	"pledgeWithMinVolume": "Min Stake Sum",
	"walletPassword": "Wallet password",
	"inputPassword": "Enter password",
	"inputPasswordAgain": "Enter the password again",
	"passwordForget": "forgotten?",
	"sure": "Confirm",
	"cancel": "Cancel",
	"redeemPledgePageTitle": "Unstake",
	"pledgeForVerifierAtNow": "Current Stake node",
	"volumeForRedeeming": "Unstaking anmount",
	"canUseVolumeForRedeem": "Amount unstake",
	"fee": "Fee",
	"redeemOfCourse": " Confirm unstaking",
	"notScreenshots": "Please do not take screenshots",
	"notScreenshotsTip": "Please do not take screenshots to share and store, it may be collected by third-party malware and cause asset loss",
	"notScreenshotsTipIAmKown": "I Know",
	"backupMnemonicListTitle": " Backup mnemonic",
	"backupMnemonicListDescription": " Please copy the mnemonic phrases in order to ensure that the backup is correct",
	"backupMnemonicInfoTip_1": "Keep the mnemonic words properly to a safe place on the isolated network。",
	"backupMnemonicInfoTip_2": "Do not share and store mnemonics in a networked environment, such as mailboxes, photo albums, social applications, etc.",
	"backupMnemonicSuccess": "Confirmed backup ",
	"backupMnemonicLoading": "Please backup",
	"backupMnemonicPageTitle": "Confirm mnemonic",
	"backupMnemonicPageDescription": " Please click on the mnemonic words in order to confirm that you back them up correctly.",
	"buttonStep": "Next step",
	"createWalletPageTitle": "Create a wallet",
	"createWalletPageDescription": "Please setup the trading password",
	"passwordFormatTip": "The password is 8-20 characters consisting of uppercase and lowercase letters",
	"argumentsClickTip_1": " Click to agree to cosmo wallet",
	"argumentsClickTip_2": "User Agreement",
	"argumentsClickTip_3": "and",
	"argumentsClickTip_4": "Privacy policy",
	"startCreateButton": "Create",
	"createWalletInFirst": "Create",
	"importWallet": "Import Wallet",
	"hadWallet": "Already have a wallet",
	"backupMnemonicTipForSafeTitle": "Safety reminder",
	"backupMnemonicTipForSafeTip_1": "Your mnemonic phrase is not backed up, please make sure to back up the mnemonic phrase ",
	"backupMnemonicTipForSafeTip_2": "The mnemonic phrase can be used to restore the wallet assets under the identity to prevent the loss of assets caused by forgetting the password, deleting the application, and losing the mobile phone.",
	"backupMnemonicTipForCancel": "Don't remind",
	"backupMnemonicTipForSure": "Backup now",
	"walletAddress": "Wallet address",
	"walletBalance": "Wallet balance",
	"bumberOfTransactions": "Number of transactions",
	"sendAmountVolumn": "Sended amount",
	"impoutAmountVolumn": "Received amount",
	"transferPageTitle": "Transfer",
	"pledgePageTitle": "Stake",
	"smartContractPageTitle": "Token transfer",
	"homeTransactionTitle": "Transaction",
	"homeTransactionDescription": "Swap Transaction",
	"homeTokenTitle": "Token issuance",
	"homeTokenDescription": "One-click digital token issuance",
	"homeLogsTitle": "Wallet record",
	"homeLogsDescription": " Wallet asset record",
	"mnemonicInputPlaceholder": "Enter the mnemonic phrase and use a semicolon \";\" to separate each word",
	"mnemonic": "Mnemonic",
	"startImport": "Start import",
	"reset": "Reset",
	"all": "All",
	"inTo": "Into",
	"sendTo": "Transfer to",
	"pledgeTo": "Staking to",
	"unPledge": "Cancel Staking",
	"withdraw": "withdraw",
	"profit": "Profit",
	"withdrawProfit": "Withdraw",
	"rePledgeTo": "Transfer stake to",
	"invalidType": " Invalid type",
	"noticeList": "Notification Center",
	"allReaded": "All read",
	"redeemConfirmTitle": "Unstaking reminder",
	"redeemConfirmDescription": " Do you need to withdraw all rewards",
	"pledgeDetailPageTitle": "Stake details",
	"verifierAddress": " Validator address",
	"status": "Status",
	"pledgedVolumeForVerifier": "Staked amount",
	"rewardVolumeForVerifier": "Earned reward",
	"rePledgingVolumeForVerifier": "Transfer stake amount",
	"redeemingVolumeForVerifier": "Unstaking amount",
	"redeemReward": "Withdraw rewards",
	"rePledge": "Transfer stake",
	"rePledging": "Staking",
	"reRedeeming": "Unstaking",
	"pledgeReward": "Stake reward",
	"nodeOfverifier": "Validator node",
	"lookAt": "Check",
	"pledgeStakingPageTitle": "Stake mining instructions ",
	"pledgeStakingPageDesc_1": "From your wallet, choose validator to stake.",
	"pledgeStakingPageDesc_2": "Staking plugcn to validation nodes is not completely risk-free. If the validation node commits malicious behavior during operation, plugcn of the validator node and the delegator will be deducted as penalty.",
	"pledgeStakingPageDesc_3": "Validators are rewarded for proposing and proving blocks, and the rewards are linked to the total amount of plugcn staked in the network.",
	"pledgeStakingPageDesc_4": " After staking, you can \"transfer\" the stake, but you need to wait 21 days after the stake is transferred before you can transfer the stake again.",
	"pledgeStakingPageDesc_5": "After staking, you can \"transfer\" the stake. The staked plugcn can be unstaked at any time to the validator node, but it takes 21 days to unstake.",
	"qrCodeScannerBox": "Please scan the QR code in the box",
	"selectReVerifierNode": "Please select the node to accept the transfer",
	"rePledgeNode": " Transfer stake node",
	"selectPledgeNode": "Choose node",
	"changePledgeNode": "Change node",
	"rePledgeVolume": "Transfer stake amount",
	"canRePledgeVolume": "Transferrable stake amount",
	"allRePledge": "Transfer all",
	"sureRePledge": "Transfer all",
	"resetPasswordPageTitle": "Reset Password",
	"resetPasswordPageDescription": "Use mnemonic phrase to reset password",
	"settingPageTitle": "More settings",
	"about": "About",
	"backupTipTitle": "Backup tips",
	"backupTipDescription": "Obtaining the mnemonic phrase is equivalent to owning the wallet asset rights",
	"backupTipDescription_1": "The mnemonic composes of English words, please copy it and keep it in a safe place",
	"backupTipDescription_2": "Please make sure to copy and backup in a safe and unmonitored environment",
	"backupTipSure": "Backup now",
	"backupTipLate": "Backup later",
	"transferAllTipTitle": "Input prompt",
	"transferAllTipDescription": "Do you need to transfer the entire amount?",
	"logs": "Log",
	"inToAddress": "Receiving Address",
	"inToAddressTip": "Scan or paste wallet address",
	"transferSendVolume": "Number of transfers",
	"canTransferSendVolume": "Transferrable amount",
	"allTransferButton": "Transfer all",
	"send": "Send",
	"accountTransfer": "Account transfer",
	"cancelTransfer": "Cancel transfer",
	"transferDetailPageTitle": "Transaction Details",
	"executionStatus": "Status",
	"executionStartTime": "Execution time",
	"transferType": "Transaciton type",
	"senderInTransfer": "Sender",
	"receiverInTransfer": "Receiver",
	"callerInTransfer": "Initiator",
	"changerInTransfer": "Transferor",
	"executionerInTransfer": "Executor",
	"openAll": "Expand all",
	"transferAllVolumeWithSend": "Total amount sent",
	"transferAllVolumeWithReceive": "Total amount received",
	"transferAllVolumeWithAll": "Total transaction",
	"transferTxHash": "Transaction hash",
	"transferInBlockHeight": "Block height",
	"transferAtRemark": "Remarks",
	"transferAtRawLog": "Raw data",
	"copy": "Copy",
	"burnRatioWithPledgeToVerifier": "Burn ratio",
	"pledgeVolume": "Stake amount",
	"canUseToPledgeVolume": "Available to stake",
	"pledgeTipList_1": "The delegated plugcn can be unstaked any time, but it takes 21 days to unstake",
	"pledgeTipList_2": "If the validator node misbehaves (such as double signature and frequent offline), some of the delegated tokens may be penalized. In order to avoid risks, please carefully select qualified validator nodes",
	"verifierInfoPageTitle": " Validator information",
	"pledgeIsNone": "Not staked",
	"goToPledgeButton": "Go to Staking",
	"verifierListPageTitle": "List of validators",
	"pledged": "Staked",
	"select": "Select",
	"selectToNowWallet": "Switch to current wallet",
	"changeNowWalletName": "Change wallet name",
	"deleteNowWallet": "Delete current wallet",
	"changeNickname": "Modify username",
	"newNickname": "New username",
	"walletListPageTitle": "Wallet management",
	"walletUsing": "Using",
	"addWallet": "Add Wallet",
	"languageVersion": "Language version",
	"languageListPageTitle": "Change language",
	"nowLanguage": "Current language",
	"proposaler": "Proposer",		
	"initBound": "Initial Stake Sum",
	"allBound": "Total Stake Sum",
	"submitTime": "Initial Listing Time",
	"moneyEndTime": "End of Private Sales",
	"proposalType": "Type of Votes",
	"proposalStartTime": "Voting Commence",
	"proposalEndTime": "Voting Ended",
	"proposalDescription": "Voting Proposal",
	"showMore": "More Information",
	"allPropposalVolume": "Total Votes",
	"agree": "Agree",
	"reject": "Disagree",
	"veto": "Disagree",
	"abandon": "Void my vote",
	"vote": "Vote",
	"equilibrium": "Balance",
	"depositor": "Deposit",
	"hash": "Hash ID",
	"time": "Time",
	"volume": "Volume",
	"complete": "Completed",
	"communityProposalList": "Proposal List",
	"proposalIng": "Voting in Progress",
	"passedType": "Proposal Passed",
	"rejectType": "Proposal Failed",
	"undefinedType": "Pending",
	"depositType": "Deposit in Process",
	"failedType": "Failed",
	"quorumVolume": "Vote Count",
	"mainTendency": "Tendency Towards",
	"addToken": "Add Token",
	"noData": "No Data Found",
	"cannotAdditional": "NO",
	"canAdditional": "YES",
	"createToken": "Token Created",
	"tokenName": "Full Name",
	"tokenSymbol": "Abbreviation",
	"tokenSymbolInput": "3~6 characters starting with a letter",
	"tokenMinUnit": "Token Min Unit",
	"tokenTotalSupply": "Token Total Supply",
	"tokenScale": "Accuracy",
	"tokenScaleInput": "Token Decimals",
	"tokenAdditionalType": "Token Additional Options",
	"tokenSendFee": "Token Mint Fee",
	"tokenSendApply": "Applied",
	"tokenRemoveTitle": "Remove Title",
	"tokenRemoveDesc": "Confirm to Delete Token?",
	"tokenEdit": "Edit Token Details",
	"tokenDetail": "Token Details",
	"tokenRemarks": "Remarks",
	"tokenDelete": "Delete Token",
	"tokenTransfer": "Transfer Token",
	"tokensList": "Token List",
	"symbol": "Symbol",
	"name": "Name",
	"balance": "Balance",
	"remarks": "Remarks",
	"save": "Save",
	"edit": "Edit",
	"add": "Add",
	"dappSearchPlaceholder": "Input DAPP Address",
	"recommend": "Recommendation",
	"deleteLogsTitle": "Confirm to delete records?",
	"deleteOneLogDesc": "Confirm to delete this record?",
	"deleteAllLogsDesc": "Confirm to delete all records?",
	"searchHistory": "Search history",
	"createTokenDesc1": "Any Edit，Quantity Increase，Burn，Transfer of Ownership Rights actions will caused gas fees",
	"createTokenDesc2": "Create token will cause gas fees, which will be calculated according to the type of token, token quantity etc.",
	"tokenChose": "Token Chose",
  "rePledgingLockingTip": "While current staking is still in progress, the verifier node cannot transfer staked tokens",
	"homeFlowTitle": "LP Pool",
	"homeFlowDesc": "Trending LP Pool",
	"authorize": "Authorise",
	"ban": "Ban",
	"authorizationPrompt": "Authorization Needed",
	"authorizationDescription": "Authorize DAPP for access",
	"authorizationDescriptionAddress": "Access to your wallet information",
	"authorizationDescriptionTransfer": "Access swap feature",
	"authorizationAuthorizeTip": "Once authorize, you will not be prompt again",
	"flowListTitle": "LP Pool List",
	"flowCreate": "Create LP Staking Pool",
	"flowMove": "Transfer",
	"flowInput": "Transfer In",
	"nowFlowList": "Current LP Pool Staked Sum",
	"flowAssetWithUser": "You LP Staked Sum",
	"flowInputDid": "LP Staked",
	"selectToken": "Choose your token",
	"transformtionTitle": "Swap",
	"transformtionPollAllVolume": "Total LP Staked",
	"transformtionPollDayTransVolume": "Daily Trade Volume",
	"transformtionSendVolumePleaseholder": "Enter Swap Sum",
	"willNetworkFee": "Estimated Gas Fee",
	"transformtionSureButton": "Confirm Transaction",



	"loadingWithUpgradeInstall": "downloading...",
	"loadingWithFunctionIng": "sending...",
	"loadingWithCreatIng": "creating...",
	"loadingWithImport": "importing...",
	"loadingWithRequest": "loading...",
	"loadingWithRedeem": "unstaking...",
	"loadingWithReset": "resetting...",

	"ErrorWithpermissionStorage": "Unable to download and update the app without granted read permission",
	"ErrorWithpermissionInstall": "App installation permission is not granted, unable to download and update",
	"ErrorWithpermissionCamera": "App camera permission not granted",
	"ErrorWithUpgrade": "Download failed, please close app and try again",
	"ErrorWithFeeVolume": "Transaction fee error",
	"ErrorWithInputVolume": " Input quantity error",
	"ErrorWithInputVolumeLower": " The amount entered is less than the minimum stake amount",
	"ErrorWithBalanceLowerThanFee": "The account balance is insufficient to pay the transaction fee",
	"ErrorWithBalanceLower": "Insufficient balance",
	"ErrorWithPasswordInput": "Incorrect password",
	"ErrorWithPasswordReInput": "Two passwords entered are different",
	"ErrorWithRedeemCallback": "Unstaking error, please check the app version",
	"ErrorWithRedeemTimeout": "Unstaking Timeout",
	"ErrorWithRedeemUnkown": "Unstaking error",
	"ErrorWithRedeemRewardCallback": "Reward withdrawal error, please check the app version",
	"ErrorWithRedeemRewardTimeout": "Withdrawal Timeout",
	"ErrorWithRedeemRewardUnkown": "Withdraw rewards error ",
	"ErrorWithRePledgeCallback": "Transfer error, please check app version",
	"ErrorWithRePledgeTimeout": "Transfer timeout",
	"ErrorWithRePledgeUnkown": "Transfer error",
	"ErrorWithSendCallback": "Sending error, please check the app version",
	"ErrorWithSendTimeout": "Sending timeout",
	"ErrorWithSendUnkown": "Send Error",
	"ErrorWithPledgeCallback": "Stake error, please check the app version",
	"ErrorWithPledgeTimeout": "Staking timeout",
	"ErrorWithPledgeUnkown": "Stake error",
	"ErrorWithMnemonicSelected": "Wrong set of mnemonic",
	"ErrorWithUserArguments": "Please read and agree to the user agreement and privacy policy",
	"ErrorWithMnemonicInput": "Mnemonic error",
	"ErrorWithAccountRepeat": "The current account already exists, account name:",
	"ErrorWithAddress": "The address is entered incorrectly",
	"ErrorWithTransferSelf": "Self-transfer to the same account is not allowed",
	"ErrorWithExecution": "Execution failed",
	"ErrorWithDeleteWallet": "The wallet is currently in use and cannot be deleted",
	"ErrorWithProposalCallback": " Vote Count Error",
	"ErrorWithProposalTimeout": "Voting Timeout, Please Vote Within 30 sec ",
	"ErrorWithProposalUnkown": "Voting Error Unknown",
	"ErrorWithCoinName": "Token Name Invalid",
	"ErrorWithCoinSymbol": "Token Unit Invalid",
	"ErrorWithCoinMinUnit": "Min Unit Invalid",
	"ErrorWithCoinTotalSupply": "Total Supply Invalid",
	"ErrorWithCoinInitSupply": "Initial Total Supply Invalid",
	"ErrorWithCoinScale": "Invalid Decimals",
	"ErrorWithCoinSymbolRepeat": "Token Symbol Exist",
	"ErrorWithTranstionPool": "No such token in the list",
	"ErrorWithTransformationRate": "Can not exceed max order ratio of reserve coins that can be ordered at a order",


	"SuccessWithRedeem": "Unstaked successfully",
	"SuccessWithRewardRedeem": "Withdraw rewards successful",
	"SuccessRePledgeRedeem": "Transferred successfully",
	"SuccessWithCreate": "Created successfully",
	"SuccessWithCopy": "Copy successfully",
	"SuccessWithImport": "Imported successfully",
	"SuccessWithSend": "Sent successfully",
	"SuccessWithPledge": "Staked successfully",
	"SuccessWithReset": "Reset succesfully",
	"SuccessWithReaded": " All have been successfully read",
	"SuccessWithExecution": "Executed successfully",
	"SuccessWithProposal": "Proposal Passed!",
	"SuccessWithAdd": "Added Successful",
	"SuccessWithSave": "Save Success",
	"SuccessWithDelete": "Delete Success"


	,
	"memo": "Memo Info",
	"optional": "Optional"
}